-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 30, 2022 at 08:18 AM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `khanomthinalin`
--

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `ID` int(11) NOT NULL,
  `Username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `lasrname` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `phonenumber` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `address` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `datesave` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='ตารางเก็บข้อมูลสมาชิก';

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`ID`, `Username`, `name`, `lasrname`, `password`, `phonenumber`, `address`, `datesave`) VALUES
(2, 'Mina', 'มีนา', 'นอนยังลูก', '12345', '0876546647', 'ขอนแก่น', '2022-06-23 12:24:40'),
(3, 'นลินนิ', 'นลินนิภา', 'กองโส', '234235', '0902876662', 'กทม', '2022-06-23 12:45:00'),
(4, 'นิวนาย', 'อนุเทพ', 'แฟนนิว', '123456', '090287668', 'ขอนแก่น', '2022-06-23 12:51:30'),
(5, 'นาย', 'อนุเทพ', 'แฟนนิว', '123456', '0902876682', 'ขอนแก่น', '2022-06-23 12:53:33'),
(6, 'Nina', 'นีน่า', 'ไม่สวย', '111111', '0876543210', 'cnx', '2022-06-23 12:59:05'),
(7, 'test', 'test', 'test', '123456', '9641380897', 'bkk', '2022-06-23 13:09:14'),
(9, 'ปราณปริยา', 'ปราณปริยา', 'งีบส่อม', '987654', '0902876682', 'บ้านโนนทอง ต.โนนทอง อ.บรบือ จ.มหาสารคาม\r\n44130 ', '2022-06-23 19:44:46'),
(10, 'tt', 'กุลธิดา', 'แสนพันนา', '123457', '0973018863', 'หลังมอ # รีเพย์', '2022-06-28 12:54:26'),
(11, 'dovedove', 'Oatchariya', 'Somsakeesit', '123456', '1234567890', 'คอนโดเซเร', '2022-06-28 18:06:37'),
(12, 'newnay', 'อนุเทพ', 'ศูนย์คำ', '146112', '0851851461', 'หอแปดหลัง', '2022-06-28 22:42:39'),
(13, 'บอส', 'บอส', 'น้อย', '345678', '0851285461', 'ขอนแก่น', '2022-07-11 11:56:24'),
(14, 'กิมสุ่ย', 'กิม', 'สุ่ย', '654321', '0902878782', 'ขอนเเจ่น', '2022-07-11 11:59:40'),
(15, 'นิวนิว', 'นลินนิภา', 'กองโส', '456789', '09028766ลw', 'wes', '2022-07-20 11:59:30'),
(16, 'นะนาย', 'อนุเทพ', 'นายนาย', '234516', '09028766rr', 'wry', '2022-07-20 12:11:46'),
(17, 'บอสน้อย', 'บอส', 'น้อย', '678876', '0902876689', 'ในเมือง', '2022-07-20 12:31:41'),
(18, 'ณัฐชนน', 'ณัฐชนน', 'สินเจริญเลิศ', '123456', '0851632706', '435/8 ต.หมากเเข้ง อ.เมือง จ.อุดรธานี 41000', '2022-07-26 20:17:03');

-- --------------------------------------------------------

--
-- Table structure for table `menu`
--

CREATE TABLE `menu` (
  `ID` int(11) NOT NULL,
  `Menu` text COLLATE utf8_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `menu`
--

INSERT INTO `menu` (`ID`, `Menu`, `quantity`, `price`) VALUES
(5, 'ขนมทองม้วน', 15, 20),
(7, 'ขนมกล้วยบวชชี', 26, 20),
(9, 'ขนมขี้หนู', 26, 20),
(12, 'ขนมจ่ามงกุฏ', 16, 20),
(18, 'ขนมทองเอก', 69, 25),
(19, 'ขนมน้ำดอกไม้', 84, 20),
(20, 'ขนมบ้าบิ่น', 14, 20),
(21, 'ขนมเบื้อง', 6, 25),
(22, 'ขนมปุยฝ้าย', 49, 20),
(24, 'ขนมพระจันทร์', 5, 30),
(25, 'ขนมสเน่ห์จันทร์', 21, 20),
(26, 'ขนมสัมปันนี', 14, 25),
(27, 'ขนมใส่ไส้', 12, 20),
(28, 'ขนมทองหยอด', 42, 20),
(29, 'ขนมทองหยิบ', 22, 20),
(30, 'ทับทิมกรอบ', 54, 20),
(31, 'บัวลอย', 16, 20),
(32, 'ฝอยทอง', 18, 15),
(33, 'เม็ดขนุน', 30, 20),
(34, 'รวมมิตรกะทิสด', 39, 30),
(35, 'ลอดช่อง', 32, 20),
(36, 'วุ้นมะพร้าว', 26, 10),
(37, 'น้ำกระเจี๊ยบ', 25, 20),
(38, 'น้ำโอเลี้ยง', 29, 20),
(39, 'น้ำโกโก้', 28, 20),
(40, 'น้ำชาเย็น', 29, 20),
(41, 'น้ำนมชมพู', 27, 20),
(42, 'น้ำเก๊กฮวย', 25, 20),
(43, 'น้ำส้ม', 27, 20),
(44, 'น้ำกาแฟ', 51, 20),
(45, 'น้ำเปล่า', 98, 10),
(49, 'ขนมจ่ามงกุฏ', 16, 20),
(50, 'ขนมขี้หนู', 26, 20),
(54, 'น้ำเเข็ง', 100, 10),
(56, 'ขนมครก', 44, 25),
(57, 'ขนมเทียน', 34, 20),
(59, 'ข้าวเหนียวมะม่วง', 22, 40),
(60, 'กล้วยฉาบ', 33, 20);

-- --------------------------------------------------------

--
-- Table structure for table `orderhistory`
--

CREATE TABLE `orderhistory` (
  `Menu` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `quantity` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `price` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `totalprice` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `datesave` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `orderhistory`
--

INSERT INTO `orderhistory` (`Menu`, `quantity`, `price`, `totalprice`, `datesave`) VALUES
('ขนมครก', '4', '20', '80', '2022-06-23 22:20:50');

-- --------------------------------------------------------

--
-- Table structure for table `story`
--

CREATE TABLE `story` (
  `ID` int(255) NOT NULL,
  `Menu` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `quantity` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `datesave` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `ตะกร้า`
--

CREATE TABLE `ตะกร้า` (
  `ID` int(11) NOT NULL,
  `orderid` int(11) NOT NULL,
  `Menu` text COLLATE utf8_unicode_ci NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `Username` text COLLATE utf8_unicode_ci NOT NULL,
  `สถานะ` int(11) NOT NULL,
  `เวลา` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `ตะกร้า`
--

INSERT INTO `ตะกร้า` (`ID`, `orderid`, `Menu`, `price`, `quantity`, `Username`, `สถานะ`, `เวลา`) VALUES
(1, 0, 'ขนมบ้าบิ่น', 20, 1, '', 0, ''),
(2, 0, 'ขนมน้ำดอกไม้', 20, 1, '', 0, ''),
(3, 1, 'ขนมบ้าบิ่น', 20, 1, '', 0, ''),
(4, 1, 'ขนมน้ำดอกไม้', 20, 1, '', 0, ''),
(5, 2, 'ขนมบ้าบิ่น', 20, 2, '', 0, '17/07/2565 '),
(6, 2, 'ขนมจ่ามงกุฏ', 20, 1, '', 0, '17/07/2565 '),
(7, 3, 'ขนมจ่ามงกุฏ', 20, 1, '', 0, '17/07/2565 '),
(8, 4, 'รวมมิตรกะทิสด', 30, 1, '', 0, '20/07/2565 '),
(9, 4, 'ขนมบ้าบิ่น', 20, 1, '', 0, '20/07/2565 '),
(10, 5, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(11, 6, 'ขนมทองเอก', 25, 2, 'บอสน้อย', 0, '20/07/2565 '),
(12, 6, 'เม็ดขนุน', 20, 1, 'บอสน้อย', 0, '20/07/2565 '),
(13, 6, 'ข้าวเหนียวมะม่วง', 40, 1, 'บอสน้อย', 0, '20/07/2565 '),
(14, 6, 'น้ำโกโก้', 20, 1, 'บอสน้อย', 0, '20/07/2565 '),
(15, 7, 'ขนมทองเอก', 25, 1, 'Nina', 0, '20/07/2565 '),
(16, 7, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(17, 7, 'ขนมจ่ามงกุฏ', 20, 1, 'Nina', 0, '20/07/2565 '),
(18, 8, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(19, 9, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '20/07/2565 '),
(20, 9, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '20/07/2565 '),
(21, 9, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '20/07/2565 '),
(22, 10, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(23, 11, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '20/07/2565 '),
(24, 12, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '20/07/2565 '),
(25, 13, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(26, 14, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(27, 15, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '20/07/2565 '),
(28, 15, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '20/07/2565 '),
(29, 16, 'ขนมจ่ามงกุฏ', 20, 1, 'Nina', 0, '20/07/2565 '),
(30, 16, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '20/07/2565 '),
(31, 16, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(32, 16, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(33, 17, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(34, 17, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(35, 17, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '20/07/2565 '),
(36, 18, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '20/07/2565 '),
(37, 18, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(38, 18, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '20/07/2565 '),
(39, 18, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '20/07/2565 '),
(40, 19, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '20/07/2565 '),
(41, 19, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/07/2565 '),
(42, 20, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '20/07/2565 '),
(43, 20, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '20/07/2565 '),
(44, 21, 'ขนมทองม้วน', 20, 1, 'Nina', 0, '20/07/2565 '),
(45, 21, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '20/07/2565 '),
(46, 22, 'ขนมทองม้วน', 20, 1, 'Nina', 0, '20/07/2565 '),
(47, 22, 'ขนมกล้วยบวชชี', 20, 1, 'Nina', 0, '20/07/2565 '),
(48, 23, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '26/07/2565 '),
(49, 23, 'ขนมทองหยิบ', 20, 1, 'Nina', 0, '26/07/2565 '),
(50, 23, 'เม็ดขนุน', 20, 1, 'Nina', 0, '26/07/2565 '),
(51, 24, 'ขนมทองเอก', 25, 1, 'Nina', 0, '26/07/2565 '),
(52, 24, 'ขนมขี้หนู', 20, 1, 'Nina', 0, '26/07/2565 '),
(53, 25, 'ขนมจ่ามงกุฏ', 20, 1, 'Nina', 0, '26/07/2565 '),
(54, 25, 'ขนมปุยฝ้าย', 20, 2, 'Nina', 0, '26/07/2565 '),
(55, 25, 'น้ำกระเจี๊ยบ', 20, 1, 'Nina', 0, '26/07/2565 '),
(56, 26, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '26/07/2565 '),
(57, 26, 'ขนมจ่ามงกุฏ', 20, 1, 'Nina', 0, '26/07/2565 '),
(58, 26, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '26/07/2565 '),
(59, 27, 'ขนมทองเอก', 25, 4, 'Nina', 0, '26/07/2565 '),
(60, 27, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '26/07/2565 '),
(61, 27, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '26/07/2565 '),
(62, 27, 'น้ำชาเย็น', 20, 1, 'Nina', 0, '26/07/2565 '),
(63, 28, 'ขนมทองหยอด', 20, 1, 'Nina', 0, '26/07/2565 '),
(64, 28, 'น้ำกระเจี๊ยบ', 20, 1, 'Nina', 0, '26/07/2565 '),
(65, 29, 'ขนมขี้หนู', 20, 6, 'Nina', 0, '26/07/2565 '),
(66, 29, 'ขนมพระจันทร์', 30, 1, 'Nina', 0, '26/07/2565 '),
(67, 29, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '26/07/2565 '),
(68, 30, 'ขนมน้ำดอกไม้', 20, 2, 'Nina', 0, '26/07/2565 '),
(69, 30, 'น้ำเปล่า', 10, 1, 'Nina', 0, '26/07/2565 '),
(70, 31, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '26/07/2565 '),
(71, 31, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '26/07/2565 '),
(72, 32, 'ขนมน้ำดอกไม้', 20, 4, '', 0, '26/07/2565 '),
(73, 32, 'ขนมจ่ามงกุฏ', 20, 1, '', 0, '26/07/2565 '),
(74, 33, 'ขนมจ่ามงกุฏ', 20, 1, 'Nina', 0, '26/07/2565 '),
(76, 34, 'ขนมขี้หนู', 20, 2, 'ณัฐชนน', 0, '26/07/2565 '),
(77, 34, 'น้ำนมชมพู', 20, 1, 'ณัฐชนน', 0, '26/07/2565 '),
(78, 34, 'ขนมน้ำดอกไม้', 20, 1, 'ณัฐชนน', 0, '26/07/2565 '),
(79, 35, 'ขนมขี้หนู', 20, 2, 'ณัฐชนน', 0, '26/07/2565 '),
(80, 35, 'น้ำนมชมพู', 20, 1, 'ณัฐชนน', 0, '26/07/2565 '),
(81, 35, 'ขนมน้ำดอกไม้', 20, 1, 'ณัฐชนน', 0, '26/07/2565 '),
(82, 36, 'ขนมกล้วยบวชชี', 20, 1, 'Nina', 0, '25/08/2565 '),
(83, 36, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '25/08/2565 '),
(84, 36, 'ขนมปุยฝ้าย', 20, 2, 'Nina', 0, '25/08/2565 '),
(85, 37, 'ขนมทองเอก', 25, 1, 'Nina', 0, '25/08/2565 '),
(86, 37, 'น้ำเก๊กฮวย', 20, 2, 'Nina', 0, '25/08/2565 '),
(87, 38, 'ขนมทองเอก', 25, 1, 'Nina', 0, '25/08/2565 '),
(88, 38, 'น้ำนมชมพู', 20, 1, 'Nina', 0, '25/08/2565 '),
(89, 39, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '01/09/2565 '),
(90, 39, 'ขนมปุยฝ้าย', 20, 5, 'Nina', 0, '01/09/2565 '),
(91, 40, 'ขนมเบื้อง', 25, 1, 'Nina', 0, '01/09/2565 '),
(95, 41, 'ขนมครก', 25, 2, 'Nina', 0, '01/09/2565 '),
(96, 41, 'น้ำโอเลี้ยง', 20, 1, 'Nina', 0, '01/09/2565 '),
(98, 42, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '20/09/2565 '),
(99, 43, 'ขนมบ้าบิ่น', 20, 1, 'Nina', 0, '20/09/2565 '),
(100, 43, 'ขนมทองหยอด', 20, 1, 'Nina', 0, '20/09/2565 '),
(101, 43, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '20/09/2565 '),
(102, 43, 'น้ำเปล่า', 10, 1, 'Nina', 0, '20/09/2565 '),
(105, 44, 'ขนมน้ำดอกไม้', 20, 1, 'Nina', 0, '28/09/2565 '),
(106, 44, 'ขนมปุยฝ้าย', 20, 1, 'Nina', 0, '28/09/2565 '),
(107, 44, 'ขนมทองเอก', 25, 1, 'Nina', 0, '28/09/2565 '),
(108, 44, 'น้ำโกโก้', 20, 1, 'Nina', 0, '28/09/2565 ');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `login`
--
ALTER TABLE `login`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `menu`
--
ALTER TABLE `menu`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `ตะกร้า`
--
ALTER TABLE `ตะกร้า`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `login`
--
ALTER TABLE `login`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `menu`
--
ALTER TABLE `menu`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;

--
-- AUTO_INCREMENT for table `ตะกร้า`
--
ALTER TABLE `ตะกร้า`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
